{
  "title":
  {
    "id": "title_screen_text",
    "content": [
      "Challenge Two",
      "Play"
    ]
  },
  "room_essential_text":
  {
    "id": "essential_text",
    "content": [
      "Welcome! Please take a step forward.",
      "What's that up ahead? Oh fun! It's a green gate you need to open.",
      "Seems like the only way forward.",
      "A yellow gate blocks the upward path.",
      "It looks like someone's in the room to the right. She looks friendly.",
      "There's something yellow glowing in the room to the left.",
      "You picked up a yellow key! (Yellow Key added to your Inventory.)",
      "You ran into the friendly-looking woman.",
      "You've unlocked the path forward.",
      "There's another someone up ahead, wearing a...dark, hooded cloak?",
      "You cautiously walk into the space of this mysterious person.",
      "It's a winding corridor.",
      "The corridor bends around slightly.",
      "You run into the same hooded person as before.",
      "There's a four-way intersection up ahead.",
      "The faint sound of growling comes from behind you.",
      "The sound of growling intensifies behind you.",
      "You notice something giving off a purple glow around the bend.",
      "You picked up another key. This time, it's purple. (Purple Key added to Inventory.)",
      "As you enter the hallway, you see a table with something pinkish at the end.",
      "You picked up some Raw Meat. (Raw Meat added to Inventory.)",
      "You smell something strong on your left. Someone's there.",
      "There's an old man sitting next to you, enjoying some bread and cheese. (It looks kinda moldy.)",
      "You see some lights around you. It's not unpleasant.",
      "Another long hallway.",
      "Finally back to a familiar spot.",
      "Need some sort of key to unlock this purple gate.",
      "A man kneels before you, hands shaking.",
      "You encounter a dilapidated old man.",
      "Finally, you've made it to the end. Well done!"
    ]
  },
  "room_flavor_text":
  {
    "id": "flavor_text",
    "content": [
      "Nowhere to go but up.",
      "Four different ways to go? Ooh, how lucky!",
      "You'll be back. Don't worry.",
      "Hmm, now I wonder. How do you open colored gates?",
      "She...probably wants to tell you something.",
      "Maybe just like the gate?",
      "Oooooh!! Just like the yellow gate!",
      "Oops! Sorry about that.",
      "Sweeeeeeeet.",
      "Kinda creepy, but maybe this one's not bad.",
      "\"Um...hey! Could you point me in the right direction?\"",
      "(Ugh. I hate long empty hallways.)",
      "(C'mon! When does this end?)",
      "\"Oh...hello again.\"",
      "All it needs is a few stop signs.",
      "*sniff sniff* (Is that a butcher to the right?)",
      "Oooooh!! There's a shiny purple glow over there!",
      "Now where have you seen that color before?",
      "Shiiiiinyyyy!!",
      "(Aww, so it's not a butcher. I'm gettin' kinda hungry.)",
      "Kinda stinky up close. Good thing you brought a Ziploc just for this kind of thing.",
      "With...food!?",
      "\"Hello!\"",
      "Better find your way out!",
      "*Whistling a fine tune*",
      "Finally! Back to a familiar spot!",
      "Looks like there are two people inside! They don't seem to be doing very well...",
      "You glance at the potion on your belt.",
      "...",
      "The man and his friend shuffle behind you. You have set everyone free. Maybe you decide to help them as well."
      
    ]
  },
  "npc":
  {
    "id": "npc_text",
    "content": [
      {
        "id": "npc_00",
        "content": [
          "I'm Jikenwa. I'm a weird person. Why? My only purpose is to tell you that each key corresponds to a locked gate with the same color. Bye now.",
          "It's me again. Jikenwa. I thought I heard a beast roar.",
          "It found you!",
          "Oh, you pacified it? Good job. Go on ahead. I'm gonna check on my friend. I hope she's all right..."
        ]
      },
      {
        "id": "npc_01",
        "content": [
          "Left or right? It doesn't matter. They both take you... somewhere.",
          "Told you. I went the other way.",
          "My name? What are you, an RPG protagonist?",
          "... (only silence)"
        ]
      },
      {
        "id": "npc_02",
        "content": [
          "A beast may seem to block your way, but raw meat may its purpose sway.",
          "...In other words, use raw meat to get rid of the beast blocking the way out."
        ]
      },
      {
        "id": "npc_03",
        "content": [
          "Please, heal me, if you can.",
          "I... cannot express my gratitude enough. Here, take this key. It'll unlock your way out. I need to look after my friend. Maybe there is some way to save him still..."
        ]
      },
      {
        "id": "npc_04",
        "content": [
          "My chances are slim. Please, save my friend. He's in the other room.",
          "Thanks. I feel amazing! But I need to get my friend out of here. Let's grab his key and scram!"
        ]
      }
      ]
  }
}